import os
import time
import random


# Побуквенный вывод
def newprint(string):
    for letter in string:
        print(letter, end='', flush=True)
        time.sleep(0.03)
    print()


# Очищаем экран
os.system('clear')

newprint('Вы очнулись на космическом корабле и видите в иллюминаторе неизвестную планету. Рядом с вами на полу лежит инопланетная рация.')
newprint('Ваши действия:\n1 - осмотреть корабль\n2 - попробовать связаться с Землёй\n3 - попробовать связаться с планетой с помощью рации\n')
# Получаем ввод пользователя и записываем его в переменную
first = input()
# Сравниваем переменную с числами
if first == '1':
    newprint('Из комнаты есть три выхода. На первой двери висит табличка "Опасность", вторую заклинило, третья содержит кодовый замок и надпись.')
    newprint('Ваши действия:\n1 - открыть дверь с табличкой \n2 - попытаться открыть вторую дверь \n3 - подойти к двери замком\n')
    second = input()
    if second == '1':
        # Останавливаем выполнение программы на 2 секунды
        time.sleep(2)
        newprint('За дверью был Чужой')
        time.sleep(2)
        newprint('Вы погибли')
    elif second == '2':
        time.sleep(2)
        newprint('За дверью была дыра в стене корабля, и вас унесло в открытый космос')
        newprint('Вы погибли')

    # Место для ещё одной двери
    elif second == '3':
        newprint('Надпись гласит: \nКапитанская рубка.\nДля входа введите округлённую скорость света в километрах за секунду')
        code = input('Введите код: ')
        if code == '300000' or code == '300 000':
            newprint('Доступ получен')
            newprint('Вы сели в капитанское кресло и направили корабль к Земле')
            newprint('Вы спасены')
        else:
            newprint('Введён неверный код. Инициирую процедуру самоуничтожения')
            time.sleep(3)
            newprint('Вы погибли')

elif first == '2':
    newprint('На приборной панели есть три кнопки: жёлтая, зелёная и белая')
    newprint('Действия:\n1 - жёлтая\n2 - зелёная\n3 - белая\n')
    second = input()
    if second == '1':
        newprint('После нажатия кнопки корабль самоуничтожился')
        time.sleep(2)
        newprint('Вы погибли')
    elif second == '2':
        newprint('При нажатии кнопки включилась радиосвязь, и через несколько часов вам удалось связаться с Землёй')
        newprint('Вас спасли')
    elif second == '3':
        newprint('При нажатии кнопки корабль включил гиперпространственные двигатели и стартовал в неизвестном направлении...')
        time.sleep(3)
        # Выбираем случайное число от 1 до 3
        random_number = random.randint(1, 3)
        # Если выпала единица, то мы спасены
        if random_number == 1:
            time.sleep(2)
            newprint('Вы вышли из гиперпространства вблизи Земли')
            newprint('Вас спасли')
        # В противном случае мы обречены на бесконечные скитания средь пустынного космоса
        else:
            newprint('Вы затерялись в космосе')

elif first == '3':
    newprint('На рации есть четыре канала: космическое агентство, служба спасения, военное агентство и агентство по инопланетным цивилизациям')
    newprint('Действия: вызвать \n1 - космическое агентство\n2 - служба спасения\n3 - военное агентство\n4 - агентство по инопланетным цивилизациям\n')
    second = '1'
    # Повторяем команды ниже пока в переменной `second` хранится '1'
    while second == "1":
        second = input()
        if second == '1':
            newprint('Космическое агентство не отвечает')
            time.sleep(2)
            newprint('Попробуйте другие каналы')
        elif second == '2':
            newprint('Ваш сигнал бедствия был перехвачен военным агентством и распознан как сигнал вражеского космического корабля из-за сбоя системы дешифровки сигнала. По кораблю был произведён обстрел и его уничтожили')
            newprint('Вы погибли')
        elif second == '3':
            newprint('Ваш сигнал был успешно дешифрован военным агентством, и за вами был выслан спасательный аппарат')
            newprint('Вас спасли')
        elif second == '4':
            newprint('Ваш сигнал был принят агентством по инопланетным цивилизациям, и на Землю был послан сигнал бедствия')
            newprint('Вас спасли')
